КАКерамика_моя_старая_база/src/Catalogs/ТипыДокументов/ТипыДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТипыДокументов</name>
  <predefined>
    <items>
      <name>Акт</name>
      <description>Акт</description>
    </items>
    <items>
      <name>Договор</name>
      <description>Договор</description>
    </items>
    <items>
      <name>КорректировочныйСчетФактура</name>
      <description>Корректировочный счет-фактура</description>
    </items>
    <items>
      <name>Накладная</name>
      <description>Накладная</description>
    </items>
    <items>
      <name>ОтчетКомиссионераОПродажах</name>
      <description>Отчет комиссионера о продажах</description>
    </items>
    <items>
      <name>ОтчетКомитенту</name>
      <description>Отчет комитенту</description>
    </items>
    <items>
      <name>ОтчетОРозничныхПродажах</name>
      <description>Отчет о розничных продажах</description>
    </items>
    <items>
      <name>СправкаРасчет</name>
      <description>Справка-расчет</description>
    </items>
    <items>
      <name>СчетФактура</name>
      <description>Счет-фактура</description>
    </items>
    <items>
      <name>УКД</name>
      <description>УКД</description>
    </items>
    <items>
      <name>УПД</name>
      <description>УПД</description>
    </items>
  </predefined>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

КАКерамика_моя_старая_база/src/Enums/ВидыЭД/ВидыЭД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыЭД</name>
  <enumValues>
    <name>АктВыполненныхРабот</name>
  </enumValues>
  <enumValues>
    <name>АктЗаказчик</name>
  </enumValues>
  <enumValues>
    <name>АктИсполнитель</name>
  </enumValues>
  <enumValues>
    <name>АктНаПередачуПрав</name>
  </enumValues>
  <enumValues>
    <name>АктОРасхождениях</name>
  </enumValues>
  <enumValues>
    <name>Внутренний</name>
  </enumValues>
  <enumValues>
    <name>ВозвратТоваровМеждуОрганизациями</name>
  </enumValues>
  <enumValues>
    <name>ЗаказТовара</name>
  </enumValues>
  <enumValues>
    <name>ЗапросКоммерческихПредложений</name>
  </enumValues>
  <enumValues>
    <name>ИзвещениеОПолучении</name>
  </enumValues>
  <enumValues>
    <name>КаталогТоваров</name>
  </enumValues>
  <enumValues>
    <name>КоммерческоеПредложение</name>
  </enumValues>
  <enumValues>
    <name>КорректировочныйСчетФактура</name>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗаказ</name>
  </enumValues>
  <enumValues>
    <name>ОтчетОПродажахКомиссионногоТовара</name>
  </enumValues>
  <enumValues>
    <name>ОтчетОСписанииКомиссионногоТовара</name>
  </enumValues>
  <enumValues>
    <name>ПередачаТоваровМеждуОрганизациями</name>
  </enumValues>
  <enumValues>
    <name>Подтверждение</name>
  </enumValues>
  <enumValues>
    <name>ПрайсЛист</name>
  </enumValues>
  <enumValues>
    <name>ПредложениеОбАннулировании</name>
  </enumValues>
  <enumValues>
    <name>ПрикладнойЭД</name>
  </enumValues>
  <enumValues>
    <name>ПроизвольныйЭД</name>
  </enumValues>
  <enumValues>
    <name>СоглашениеОбИзмененииСтоимостиОтправитель</name>
  </enumValues>
  <enumValues>
    <name>СоглашениеОбИзмененииСтоимостиПолучатель</name>
  </enumValues>
  <enumValues>
    <name>СчетНаОплату</name>
  </enumValues>
  <enumValues>
    <name>СчетФактура</name>
  </enumValues>
  <enumValues>
    <name>ТОРГ12</name>
  </enumValues>
  <enumValues>
    <name>ТОРГ12Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ТОРГ12Продавец</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеОбУточнении</name>
  </enumValues>
  <enumValues>
    <name>УдалитьВыпискаБанка</name>
  </enumValues>
  <enumValues>
    <name>УдалитьДопДанные</name>
  </enumValues>
  <enumValues>
    <name>УдалитьЗапросВыписки</name>
  </enumValues>
  <enumValues>
    <name>УдалитьЗапросЗонд</name>
  </enumValues>
  <enumValues>
    <name>УдалитьЗапросНаОтзывЭД</name>
  </enumValues>
  <enumValues>
    <name>УдалитьЗапросНочнойВыписки</name>
  </enumValues>
  <enumValues>
    <name>УдалитьЗапросОСостоянииЭД</name>
  </enumValues>
  <enumValues>
    <name>УдалитьИзвещениеОСостоянииЭД</name>
  </enumValues>
  <enumValues>
    <name>УдалитьКвитанция</name>
  </enumValues>
  <enumValues>
    <name>УдалитьОшибка</name>
  </enumValues>
  <enumValues>
    <name>УдалитьПлатежноеПоручение</name>
  </enumValues>
  <enumValues>
    <name>УдалитьПлатежноеТребование</name>
  </enumValues>
  <enumValues>
    <name>УдалитьУКД_ИнформацияПокупателя</name>
  </enumValues>
  <enumValues>
    <name>УдалитьУКД_ИнформацияПродавца</name>
  </enumValues>
  <enumValues>
    <name>УдалитьУПД_ИнформацияПокупателя</name>
  </enumValues>
  <enumValues>
    <name>УдалитьУПД_ИнформацияПродавца</name>
  </enumValues>
  <enumValues>
    <name>УКД</name>
  </enumValues>
  <enumValues>
    <name>УПД</name>
  </enumValues>
  <enumValues>
    <name>СведенияОРеализацииКомиссионером</name>
  </enumValues>
  <enumValues>
    <name>СведенияОЗакупкеКомиссионером</name>
  </enumValues>
  <enumValues>
    <name>КорректировкаСведенийОРеализацииКомиссионером</name>
  </enumValues>
  <enumValues>
    <name>КорректировкаСведенийОЗакупкеКомиссионером</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Catalogs/ТипыДокументов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает тип документа, подтверждающего налогувую льготу по НДС.
//
// Параметры:
//  ВидЭД - ПеречислениеСсылка.ВидыЭД - вид электронного документа, указанный в документе реализации
//
// Возвращаемое значение:
// ТипПодтверждающегоДокумента - СправочникСсылка.ТипыДокументов или Неопределено
//
Функция ТипПодтверждающегоДокументаПоВидуЭД(ВидЭД) Экспорт
	
	Если ВидЭД = Перечисления.ВидыЭД.АктВыполненныхРабот
		ИЛИ ВидЭД = Перечисления.ВидыЭД.АктЗаказчик
		ИЛИ ВидЭД = Перечисления.ВидыЭД.АктИсполнитель
		ИЛИ ВидЭД = Перечисления.ВидыЭД.АктНаПередачуПрав Тогда 
		Возврат Справочники.ТипыДокументов.Акт;
	ИначеЕсли ВидЭД = Перечисления.ВидыЭД.ТОРГ12
		ИЛИ ВидЭД = Перечисления.ВидыЭД.ТОРГ12Покупатель
		ИЛИ ВидЭД = Перечисления.ВидыЭД.ТОРГ12Продавец Тогда 
		Возврат Справочники.ТипыДокументов.Накладная;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Обработчик обновления 3.0.51.5
// Устанавливает полное наименование для типов документов.
Процедура УстановитьПолноеНаименование() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТипыДокументов.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА ТипыДокументов.Ссылка = ЗНАЧЕНИЕ(Справочник.ТипыДокументов.Акт)
	|			ТОГДА &НаименованиеАкт
	|		КОГДА ТипыДокументов.Ссылка = ЗНАЧЕНИЕ(Справочник.ТипыДокументов.Договор)
	|			ТОГДА &НаименованиеДоговор
	|		КОГДА ТипыДокументов.Ссылка = ЗНАЧЕНИЕ(Справочник.ТипыДокументов.КорректировочныйСчетФактура)
	|			ТОГДА &НаименованиеКСФ
	|		КОГДА ТипыДокументов.Ссылка = ЗНАЧЕНИЕ(Справочник.ТипыДокументов.Накладная)
	|			ТОГДА &НаименованиеТоварнаяНакладная
	|		КОГДА ТипыДокументов.Ссылка = ЗНАЧЕНИЕ(Справочник.ТипыДокументов.ОтчетКомитенту)
	|			ТОГДА &НаименованиеОтчетКомитенту
	|		КОГДА ТипыДокументов.Ссылка = ЗНАЧЕНИЕ(Справочник.ТипыДокументов.ОтчетОРозничныхПродажах)
	|			ТОГДА &НаименованиеОтчетОРозничныхПродажах
	|		КОГДА ТипыДокументов.Ссылка = ЗНАЧЕНИЕ(Справочник.ТипыДокументов.СправкаРасчет)
	|			ТОГДА &НаименованиеСправкаРасчет
	|		КОГДА ТипыДокументов.Ссылка = ЗНАЧЕНИЕ(Справочник.ТипыДокументов.СчетФактура)
	|			ТОГДА &НаименованиеСчетФактура
	|		КОГДА ТипыДокументов.Ссылка = ЗНАЧЕНИЕ(Справочник.ТипыДокументов.УПД)
	|			ТОГДА &НаименованиеУПД
	|		КОГДА ТипыДокументов.Ссылка = ЗНАЧЕНИЕ(Справочник.ТипыДокументов.УКД)
	|			ТОГДА &НаименованиеУКД
	|	КОНЕЦ КАК ПолноеНаименование
	|ИЗ
	|	Справочник.ТипыДокументов КАК ТипыДокументов
	|ГДЕ
	|	ТипыДокументов.ПолноеНаименование = """"
	|	И ТипыДокументов.Предопределенный";
	
	Запрос.УстановитьПараметр("НаименованиеАкт",               НСтр("ru='Акт'"));
	Запрос.УстановитьПараметр("НаименованиеДоговор",           НСтр("ru='Договор'"));
	Запрос.УстановитьПараметр("НаименованиеКСФ",               НСтр("ru='Корректировочный счет-фактура'"));
	Запрос.УстановитьПараметр("НаименованиеТоварнаяНакладная", НСтр("ru='Товарная накладная'"));
	Запрос.УстановитьПараметр("НаименованиеОтчетКомитенту",    НСтр("ru='Отчет комитенту'"));
	Запрос.УстановитьПараметр("НаименованиеОтчетОРозничныхПродажах", НСтр("ru='Отчет о розничных продажах'"));
	Запрос.УстановитьПараметр("НаименованиеСправкаРасчет",     НСтр("ru='Справка-расчет'"));
	Запрос.УстановитьПараметр("НаименованиеСчетФактура",       НСтр("ru='Счет-фактура'"));
	Запрос.УстановитьПараметр("НаименованиеУПД",               НСтр("ru='Универсальный передаточный документ'"));
	Запрос.УстановитьПараметр("НаименованиеУКД",               НСтр("ru='Универсальный корректировочный документ'"));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ТипДокументаОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ТипДокументаОбъект.ПолноеНаименование = Выборка.ПолноеНаименование;
		
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ТипДокументаОбъект);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
